[
  {
    "message": "Dr. Evelyn Grayson, hailed as the savior of truth, revolutionizes data verification with her invention of Truthcoins.",
    "coins_start": 0,
    "coins_end": 1000
  },
  {
    "message": "Society embraces Truthcoins as a beacon of hope against the rising tide of misinformation.",
    "coins_start": 0,
    "coins_end": 10000
  },
  {
    "message": "Global excitement as Truthcoin mining operations expand!",
    "coins_start": 0,
    "coins_end": 10000
  },
  {
    "message": "Quantum Dynamics leads the way in Truthcoin technology - a new era of enlightenment?",
    "coins_start": 10000,
    "coins_end": 50000
  },
  {
    "message": "Experts debate the potential impact of Truthcoins on world knowledge and power structures.",
    "coins_start": 10000,
    "coins_end": 50000
  },
  {
    "message": "Local economies see a bost as Truthcoin mining creates new tech jobs",
    "coins_start": 10000,
    "coins_end": 50000
  },
  {
    "message": "Truthcoin: The currency of the future or a fleeting digital dream?",
    "coins_start": 50000,
    "coins_end": 100000
  },
  {
    "message": "Data analysts raise questions about the environmental impact of Truthcoin mining.",
    "coins_start": 50000,
    "coins_end": 100000
  },
  {
    "message": "Community leader praises Truthcoin for bringing transparency, but critics remain skeptical.",
    "coins_start": 50000,
    "coins_end": 150000
  },
  {
    "message": "Truthcoin's influence grows in political spheres; experts express concern over data use.",
    "coins_start": 100000,
    "coins_end": 200000
  },
  {
    "message": "Truthcoin mining operations expand to new regions, bringing new jobs and opportunities.",
    "coins_start": 170000,
    "coins_end": 200000
  },
  {
    "message": "Quantum Dynamics denies rumors of using Truthcoin data for market manipulation.",
    "coins_start": 100000,
    "coins_end": 200000
  },
  {
    "message": "Unprecedented rise in Truthcoin value leads to market volatility, experts urge caution.",
    "coins_start": 200000,
    "coins_end": 500000
  },
  {
    "message": "Quantum Dynamics faces scrutiny over Truthcoin's privacy policies.",
    "coins_start": 200000,
    "coins_end": 500000
  },
  {
    "message": "Activists call for regulation of Truthcoin, citing risks to personal privacy.",
    "coins_start": 250000,
    "coins_end": 500000
  },
  {
    "message": "Whistleblowers from within Quantum Dynamics reveal unsettling truths about Truthcoin.",
    "coins_start": 150000,
    "coins_end": 500000
  },
  {
    "message": "Tensions rise globally as economic uncertainty continues. Experts are baffled by the sudden changes.",
    "coins_start": 500000,
    "coins_end": 1000000
  },
  {
    "message": "Global unrest as Truthcoin's darker implications come to light.",
    "coins_start": 5000000,
    "coins_end": 10000000
  },
  {
  "message": "Speculations arise over Quantum Dynamics' ties to global intelligence agencies.",
  "coins_start": 3000000,
  "coins_end": 5000000
  },
  {
    "message": "Debate escalates on global stage about the ethics of Truthcoin mining.",
    "coins_start": 3000000,
    "coins_end": 5000000
  },
  {
    "message": "Anonymous insider claims Truthcoin data used in undisclosed surveillance programs.",
    "coins_start": 5000000,
    "coins_end": 7000000
  },
  {
    "message": "Experts call for transparency in Quantum Dynamics' data usage amidst rising public distrust.",
    "coins_start": 7000000,
    "coins_end": 10000000
  },
  {
    "message": "Reports of strange system behaviors in Truthcoin network spark user concerns.",
    "coins_start": 7000000,
    "coins_end": 10000000
  },
  {
    "message": "Whistleblower leaks documents revealing the manipulative nature of Truthcoin algorithms.",
    "coins_start": 10000000,
    "coins_end": 100000000
  },
  {
    "message": "Global protests erupt against Quantum Dynamics, calling for accountability in Truthcoin affairs.",
    "coins_start": 10000000,
    "coins_end": 100000000
  }
]